-- phpMyAdmin SQL Dump
-- version 4.5.1
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: Sep 04, 2016 at 01:15 PM
-- Server version: 10.1.13-MariaDB
-- PHP Version: 7.0.8

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `vaso`
--

-- --------------------------------------------------------

--
-- Table structure for table `department`
--

CREATE TABLE `department` (
  `id` int(11) NOT NULL,
  `department_name` varchar(255) NOT NULL,
  `status` tinyint(1) NOT NULL DEFAULT '1',
  `create_date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `employment`
--

CREATE TABLE `employment` (
  `id` int(11) NOT NULL,
  `employment_name` varchar(255) NOT NULL,
  `employment_phone` varchar(255) NOT NULL,
  `deleted` tinyint(1) NOT NULL DEFAULT '0',
  `create_date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Table structure for table `oncall`
--

CREATE TABLE `oncall` (
  `id` int(11) NOT NULL,
  `date` date NOT NULL,
  `USMP` varchar(255) DEFAULT NULL,
  `Olympus` varchar(255) DEFAULT NULL,
  `USSD` varchar(255) DEFAULT NULL,
  `VASS-01` varchar(255) DEFAULT NULL,
  `VASS-02` varchar(255) DEFAULT NULL,
  `VAM01` varchar(255) DEFAULT NULL,
  `VAM02` varchar(255) DEFAULT NULL,
  `FE-Core` varchar(255) DEFAULT NULL,
  `BE-Core` varchar(255) DEFAULT NULL,
  `SuperNova` varchar(255) DEFAULT NULL,
  `IMSO1` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `oncall`
--

INSERT INTO `oncall` (`id`, `date`, `USMP`, `Olympus`, `USSD`, `VASS-01`, `VASS-02`, `VAM01`, `VAM02`, `FE-Core`, `BE-Core`, `SuperNova`, `IMSO1`) VALUES
(1, '2016-08-01', 'กังวาล', 'กิตติ', 'สาวิตร', 'หฤหรรษ์', 'ปะดลพันธ์', 'อภิญญา', 'ทักษิณา', 'ณัฐวัฒน์', 'ฐากร', 'ภัทรพงษ์', 'ธนัญชัย'),
(2, '2016-08-02', 'กังวาล', 'กิตติ', 'สาวิตร', 'หฤหรรษ์', 'ปะดลพันธ์', 'อภิญญา', 'ทักษิณา', 'ณัฐวัฒน์', 'สรสิช', 'ฐากร', 'ธนัญชัย'),
(3, '2016-08-03', 'กังวาล', 'กิตติ', 'สาวิตร', 'หฤหรรษ์', 'ปะดลพันธ์', 'อภิญญา', 'ทักษิณา', 'ณัฐวัฒน์', 'สรสิช', 'ฐากร', 'ธนัญชัย'),
(4, '2016-08-04', 'กังวาล', 'กิตติ', 'สาวิตร', 'หฤหรรษ์', 'ปะดลพันธ์', 'อภิญญา', 'ทักษิณา', 'ณัฐวัฒน์', 'สรสิช', 'ฐากร', 'ธนัญชัย'),
(5, '2016-08-05', 'กังวาล', 'กิตติ', 'สาวิตร', 'หฤหรรษ์', 'ปะดลพันธ์', 'อภิญญา', 'ทักษิณา', 'วิศรุตฌ์', 'สรสิช', 'ฐากร', 'ธนัญชัย'),
(6, '2016-08-06', 'กังวาล', 'กิตติ', 'สาวิตร', 'หฤหรรษ์', 'ปะดลพันธ์', 'อภิญญา', 'ทักษิณา', 'วิศรุตฌ์', 'ณัฐวัฒน์', 'ฐากร', 'ธนัญชัย'),
(7, '2016-08-07', 'กังวาล', 'กิตติ', 'สาวิตร', 'หฤหรรษ์', 'ปะดลพันธ์', 'ปรียาทิพย์', 'ณปภัช', 'วิศรุตฌ์', 'ณัฐวัฒน์', 'สรสิช', 'สุนัตรา'),
(8, '2016-08-08', 'กังวาล', 'กิตติ', 'สาวิตร', 'หฤหรรษ์', 'ปะดลพันธ์', 'ปรียาทิพย์', 'ณปภัช', 'วิศรุตฌ์', 'ณัฐวัฒน์', 'สรสิช', 'สุนัตรา'),
(9, '2016-08-09', 'กังวาล', 'ยุวดี', 'สาวิตร', 'หฤหรรษ์', 'ปะดลพันธ์', 'ปรียาทิพย์', 'ณปภัช', 'วิศรุตฌ์', 'ณัฐวัฒน์', 'สรสิช', 'สุนัตรา'),
(10, '2016-08-10', 'กังวาล', 'ยุวดี', 'สาวิตร', 'หฤหรรษ์', 'ปะดลพันธ์', 'ปรียาทิพย์', 'ณปภัช', 'เดโชพล', 'วิศรุตฌ์', 'สรสิช', 'สุนัตรา'),
(11, '2016-08-11', 'ธวัชชัย', 'ยุวดี', 'สาวิตร', 'หฤหรรษ์', 'ปะดลพันธ์', 'ปรียาทิพย์', 'ณปภัช', 'เดโชพล', 'วิศรุตฌ์', 'ณัฐวัฒน์', 'สุนัตรา'),
(12, '2016-08-12', 'ธวัชชัย', 'ยุวดี', 'สาวิตร', 'หฤหรรษ์', 'ปะดลพันธ์', 'ปรียาทิพย์', 'ณปภัช', 'เดโชพล', 'วิศรุตฌ์', 'ณัฐวัฒน์', 'สุนัตรา'),
(13, '2016-08-13', 'ธวัชชัย', 'ยุวดี', 'สาวิตร', 'หฤหรรษ์', 'ปะดลพันธ์', 'ณปภัช', 'อภิญญา', 'เดโชพล', 'วิศรุตฌ์', 'ณัฐวัฒน์', 'สิทธิพร'),
(14, '2016-08-14', 'ธวัชชัย', 'ยุวดี', 'สาวิตร', 'หฤหรรษ์', 'ปะดลพันธ์', 'ณปภัช', 'อภิญญา', 'เดโชพล', 'วิศรุตฌ์', 'ณัฐวัฒน์', 'สิทธิพร'),
(15, '2016-08-15', 'ธวัชชัย', 'ยุวดี', 'สาวิตร', 'หฤหรรษ์', 'ปะดลพันธ์', 'ณปภัช', 'อภิญญา', 'สมนึก', 'เดโชพล', 'วิศรุตฌ์', 'สิทธิพร'),
(16, '2016-08-16', 'ธวัชชัย', 'กิตติ', 'สาวิตร', 'จิรายุ', 'วิชัย', 'ณปภัช', 'อภิญญา', 'สมนึก', 'เดโชพล', 'วิศรุตฌ์', 'สิทธิพร'),
(17, '2016-08-17', 'ธวัชชัย', 'กิตติ', 'สาวิตร', 'จิรายุ', 'วิชัย', 'ณปภัช', 'อภิญญา', 'สมนึก', 'เดโชพล', 'วิศรุตฌ์', 'สิทธิพร'),
(18, '2016-08-18', 'ธวัชชัย', 'กิตติ', 'สาวิตร', 'จิรายุ', 'วิชัย', 'ณปภัช', 'อภิญญา', 'สมนึก', 'เดโชพล', 'วิศรุตฌ์', 'สิทธิพร'),
(19, '2016-08-19', 'ธวัชชัย', 'กิตติ', 'สาวิตร', 'จิรายุ', 'วิชัย', 'ศุภกร', 'ปรียาทิพย์', 'ภัทรพงษ์', 'เดโชพล', 'วิศรุตฌ์', 'สิทธา'),
(20, '2016-08-20', 'ธวัชชัย', 'กิตติ', 'สาวิตร', 'จิรายุ', 'วิชัย', 'ศุภกร', 'ปรียาทิพย์', 'ภัทรพงษ์', 'สมนึก', 'เดโชพล', 'สิทธา'),
(21, '2016-08-21', 'ปัญจสาย', 'กิตติ', 'อดิศักดิ์', 'จิรายุ', 'วิชัย', 'ศุภกร', 'ปรียาทิพย์', 'ภัทรพงษ์', 'สมนึก', 'เดโชพล', 'สิทธา'),
(22, '2016-08-22', 'ปัญจสาย', 'กิตติ', 'อดิศักดิ์', 'จิรายุ', 'วิชัย', 'ศุภกร', 'ปรียาทิพย์', 'ภัทรพงษ์', 'สมนึก', 'เดโชพล', 'สิทธา'),
(23, '2016-08-23', 'ปัญจสาย', 'ยุวดี', 'อดิศักดิ์', 'จิรายุ', 'วิชัย', 'ศุภกร', 'ปรียาทิพย์', 'ฐากร', 'สมนึก', 'เดโชพล', 'สิทธา'),
(24, '2016-08-24', 'ปัญจสาย', 'ยุวดี', 'อดิศักดิ์', 'จิรายุ', 'วิชัย', 'ศุภกร', 'ปรียาทิพย์', 'ฐากร', 'ภัทรพงษ์', 'เดโชพล', 'สิทธา'),
(25, '2016-08-25', 'ปัญจสาย', 'ยุวดี', 'อดิศักดิ์', 'จิรายุ', 'วิชัย', 'ศุภกร', 'ปรียาทิพย์', 'ฐากร', 'ภัทรพงษ์', 'สมนึก', 'วสวัตติ์'),
(26, '2016-08-26', 'ปัญจสาย', 'ยุวดี', 'อดิศักดิ์', 'จิรายุ', 'วิชัย', 'ทักษิณา', 'ศุภกร', 'ฐากร', 'ภัทรพงษ์', 'สมนึก', 'วสวัตติ์'),
(27, '2016-08-27', 'ปัญจสาย', 'ยุวดี', 'อดิศักดิ์', 'จิรายุ', 'วิชัย', 'ทักษิณา', 'ศุภกร', 'ฐากร', 'ภัทรพงษ์', 'สมนึก', 'วสวัตติ์'),
(28, '2016-08-28', 'ปัญจสาย', 'ยุวดี', 'อดิศักดิ์', 'จิรายุ', 'วิชัย', 'ทักษิณา', 'ศุภกร', 'สรสิช', 'ฐากร', 'สมนึก', 'วสวัตติ์'),
(29, '2016-08-29', 'ปัญจสาย', 'ยุวดี', 'อดิศักดิ์', 'จิรายุ', 'วิชัย', 'ทักษิณา', 'ศุภกร', 'สรสิช', 'ฐากร', 'ภัทรพงษ์', 'วสวัตติ์'),
(30, '2016-08-30', 'ปัญจสาย', 'กิตติ', 'อดิศักดิ์', 'จิรายุ', 'วิชัย', 'ทักษิณา', 'ศุภกร', 'สรสิช', 'ฐากร', 'ภัทรพงษ์', 'วสวัตติ์'),
(31, '2016-08-31', 'ปัญจสาย', 'กิตติ', 'อดิศักดิ์', 'จิรายุ', 'วิชัย', 'ทักษิณา', 'ศุภกร', 'สรสิช', 'ฐากร', 'ภัทรพงษ์', 'วสวัตติ์');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `department`
--
ALTER TABLE `department`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `employment`
--
ALTER TABLE `employment`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `oncall`
--
ALTER TABLE `oncall`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `date` (`date`),
  ADD KEY `date_2` (`date`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `department`
--
ALTER TABLE `department`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `employment`
--
ALTER TABLE `employment`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `oncall`
--
ALTER TABLE `oncall`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=32;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
