@extends('layouts.default')

@section('content')

<div id="example"></div>
<input id="save_data" type="button" value="Save Data" />

<script data-jsfiddle="example">
    var data = [

        ['Date','USMP','Olympus','USSD','VASS-01','VASS-02','VAMO1','VAMO2','FE-Core','BE-Core','SuperNova','IMSO1'],
        ['1','กังวาล','กิตติ','สาวิตร','หฤหรรษ์','ปะดลพันธ์','อภิญญา','ทักษิณา','ณัฐวัฒน์','ฐากร','ภัทรพงษ์','ธนัญชัย']/*,
                  ['2','กังวาล','กิตติ','สาวิตร','หฤหรรษ์','ปะดลพันธ์','อภิญญา','ทักษิณา','ณัฐวัฒน์','สรสิช','ฐากร','ธนัญชัย'],
                  ['3','กังวาล','กิตติ','สาวิตร','หฤหรรษ์','ปะดลพันธ์','อภิญญา','ทักษิณา','ณัฐวัฒน์','สรสิช','ฐากร','ธนัญชัย'],
                  ['4','กังวาล','กิตติ','สาวิตร','หฤหรรษ์','ปะดลพันธ์','อภิญญา','ทักษิณา','ณัฐวัฒน์','สรสิช','ฐากร','ธนัญชัย'],
                  ['5','กังวาล','กิตติ','สาวิตร','หฤหรรษ์','ปะดลพันธ์','อภิญญา','ทักษิณา','วิศรุตฌ์','สรสิช','ฐากร','ธนัญชัย'],
                  ['6','กังวาล','กิตติ','สาวิตร','หฤหรรษ์','ปะดลพันธ์','อภิญญา','ทักษิณา','วิศรุตฌ์','ณัฐวัฒน์','ฐากร','ธนัญชัย'],
                  ['7','กังวาล','กิตติ','สาวิตร','หฤหรรษ์','ปะดลพันธ์','ปรียาทิพย์','ณปภัช','วิศรุตฌ์','ณัฐวัฒน์','สรสิช','สุนัตรา'],
                  ['8','กังวาล','กิตติ','สาวิตร','หฤหรรษ์','ปะดลพันธ์','ปรียาทิพย์','ณปภัช','วิศรุตฌ์','ณัฐวัฒน์','สรสิช','สุนัตรา'],
                  ['9','กังวาล','ยุวดี','สาวิตร','หฤหรรษ์','ปะดลพันธ์','ปรียาทิพย์','ณปภัช','วิศรุตฌ์','ณัฐวัฒน์','สรสิช','สุนัตรา'],
                  ['10','กังวาล','ยุวดี','สาวิตร','หฤหรรษ์','ปะดลพันธ์','ปรียาทิพย์','ณปภัช','เดโชพล','วิศรุตฌ์','สรสิช','สุนัตรา'],
                  ['11','ธวัชชัย','ยุวดี','สาวิตร','หฤหรรษ์','ปะดลพันธ์','ปรียาทิพย์','ณปภัช','เดโชพล','วิศรุตฌ์','ณัฐวัฒน์','สุนัตรา'],
                  ['12','ธวัชชัย','ยุวดี','สาวิตร','หฤหรรษ์','ปะดลพันธ์','ปรียาทิพย์','ณปภัช','เดโชพล','วิศรุตฌ์','ณัฐวัฒน์','สุนัตรา'],
                  ['13','ธวัชชัย','ยุวดี','สาวิตร','หฤหรรษ์','ปะดลพันธ์','ณปภัช','อภิญญา','เดโชพล','วิศรุตฌ์','ณัฐวัฒน์','สิทธิพร'],
                  ['14','ธวัชชัย','ยุวดี','สาวิตร','หฤหรรษ์','ปะดลพันธ์','ณปภัช','อภิญญา','เดโชพล','วิศรุตฌ์','ณัฐวัฒน์','สิทธิพร'],
                  ['15','ธวัชชัย','ยุวดี','สาวิตร','หฤหรรษ์','ปะดลพันธ์','ณปภัช','อภิญญา','สมนึก','เดโชพล','วิศรุตฌ์','สิทธิพร'],
                  ['16','ธวัชชัย','กิตติ','สาวิตร','จิรายุ','วิชัย','ณปภัช','อภิญญา','สมนึก','เดโชพล','วิศรุตฌ์','สิทธิพร'],
                  ['17','ธวัชชัย','กิตติ','สาวิตร','จิรายุ','วิชัย','ณปภัช','อภิญญา','สมนึก','เดโชพล','วิศรุตฌ์','สิทธิพร'],
                  ['18','ธวัชชัย','กิตติ','สาวิตร','จิรายุ','วิชัย','ณปภัช','อภิญญา','สมนึก','เดโชพล','วิศรุตฌ์','สิทธิพร'],
                  ['19','ธวัชชัย','กิตติ','สาวิตร','จิรายุ','วิชัย','ศุภกร','ปรียาทิพย์','ภัทรพงษ์','เดโชพล','วิศรุตฌ์','สิทธา'],
                  ['20','ธวัชชัย','กิตติ','สาวิตร','จิรายุ','วิชัย','ศุภกร','ปรียาทิพย์','ภัทรพงษ์','สมนึก','เดโชพล','สิทธา'],
                  ['21','ปัญจสาย','กิตติ','อดิศักดิ์','จิรายุ','วิชัย','ศุภกร','ปรียาทิพย์','ภัทรพงษ์','สมนึก','เดโชพล','สิทธา'],
                  ['22','ปัญจสาย','กิตติ','อดิศักดิ์','จิรายุ','วิชัย','ศุภกร','ปรียาทิพย์','ภัทรพงษ์','สมนึก','เดโชพล','สิทธา'],
                  ['23','ปัญจสาย','ยุวดี','อดิศักดิ์','จิรายุ','วิชัย','ศุภกร','ปรียาทิพย์','ฐากร','สมนึก','เดโชพล','สิทธา'],
                  ['24','ปัญจสาย','ยุวดี','อดิศักดิ์','จิรายุ','วิชัย','ศุภกร','ปรียาทิพย์','ฐากร','ภัทรพงษ์','เดโชพล','สิทธา'],
                  ['25','ปัญจสาย','ยุวดี','อดิศักดิ์','จิรายุ','วิชัย','ศุภกร','ปรียาทิพย์','ฐากร','ภัทรพงษ์','สมนึก','วสวัตติ์'],
                  ['26','ปัญจสาย','ยุวดี','อดิศักดิ์','จิรายุ','วิชัย','ทักษิณา','ศุภกร','ฐากร','ภัทรพงษ์','สมนึก','วสวัตติ์'],
                  ['27','ปัญจสาย','ยุวดี','อดิศักดิ์','จิรายุ','วิชัย','ทักษิณา','ศุภกร','ฐากร','ภัทรพงษ์','สมนึก','วสวัตติ์'],
                  ['28','ปัญจสาย','ยุวดี','อดิศักดิ์','จิรายุ','วิชัย','ทักษิณา','ศุภกร','สรสิช','ฐากร','สมนึก','วสวัตติ์'],
                  ['29','ปัญจสาย','ยุวดี','อดิศักดิ์','จิรายุ','วิชัย','ทักษิณา','ศุภกร','สรสิช','ฐากร','ภัทรพงษ์','วสวัตติ์'],
                  ['30','ปัญจสาย','กิตติ','อดิศักดิ์','จิรายุ','วิชัย','ทักษิณา','ศุภกร','สรสิช','ฐากร','ภัทรพงษ์','วสวัตติ์'],
                  ['31','ปัญจสาย','กิตติ','อดิศักดิ์','จิรายุ','วิชัย','ทักษิณา','ศุภกร','สรสิช','ฐากร','ภัทรพงษ์','วสวัตติ์']
                  */
                ],
        container = document.getElementById('example'),
        hot;

        hot = new Handsontable(container, {
            data: data,
            colHeaders: true,
            contextMenu: true
        });
</script>


<script>
    $("#save_data").click(function(){
      console.log(data);
      data.push(['30','ปัญจสาย','กิตติ','อดิศักดิ์','จิรายุ','วิชัย','ทักษิณา','ศุภกร','สรสิช','ฐากร','ภัทรพงษ์','วสวัตติ์']);
      hot.loadData(
          data // here you would define a new renderer for whatever cells you want to change the renderer for
      );
    });
</script>

@stop
